In [ ]:
import pandas as pd

In [ ]:
titanic_training = pd.read_csv("https://titanic-data-set.s3.amazonaws.com/train.csv")

In [ ]:
titanic_training.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic_training.shape

(891, 12)

In [ ]:
titanic_training.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic_training.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
titanic_training.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [ ]:
titanic_training.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
titanic_training.index

RangeIndex(start=0, stop=891, step=1)

In [ ]:
titanic_training['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [ ]:
titanic_training.Sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

Limpieza de Datos
NaN

In [ ]:
titanic_training.isna()

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [ ]:
titanic_training.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
rows_with_cabin = titanic_training['Cabin'].isna() == False
titanic_training[rows_with_cabin].head()

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
3             4         1       1  ...  53.1000  C123         S
6             7         0       1  ...  51.8625   E46         S
10           11         1       3  ...  16.7000    G6         S
11           12         1       1  ...  26.5500  C103         S

[5 rows x 12 columns]

In [ ]:
rows_with_cabin = titanic_training['Cabin'].isna() == True
titanic_training[rows_with_cabin].head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
2            3         1       3  ...   7.9250   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic_training["Name"].duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Name, Length: 891, dtype: bool

In [ ]:
titanic_training["Name"].duplicated().sum()

0

In [ ]:
titanic_training['Cabin'].duplicated().isna()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Cabin, Length: 891, dtype: bool

In [ ]:
def titanic_children(passenger):

  age, sex=passenger
  if age<16:
    return 'child'
  else:
    return sex

In [ ]:
titanic_training['person'] = titanic_training[['Age','Sex']].apply(titanic_children, axis=1)

In [ ]:
titanic_training.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  person
0            1         0       3  ...   NaN        S    male
1            2         1       1  ...   C85        C  female
2            3         1       3  ...   NaN        S  female
3            4         1       1  ...  C123        S  female
4            5         0       3  ...   NaN        S    male

[5 rows x 13 columns]

In [ ]:
mean_age=titanic_training['Age'].mean()
median_age=titanic_training['Age'].median()

print(mean_age,median_age)

29.69911764705882 28.0

ImputaciÃ³n

In [ ]:
titanic_training['Age']=titanic_training['Age'].fillna(mean_age)

In [ ]:
titanic_training.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
person           0
dtype: int64

In [ ]:
titanic_training2=titanic_training['Cabin'].dropna()
titanic_training2.isna().sum()

0

In [ ]:
titanic_training.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  person       891 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

In [ ]:
titanic_training['Alone']=titanic_training['SibSp']+titanic_training["Parch"]
titanic_training["Alone"].head()

0    1
1    1
2    0
3    1
4    0
Name: Alone, dtype: int64

In [ ]:
titanic_training["Alone"]>0

0       True
1       True
2      False
3       True
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Alone, Length: 891, dtype: bool

In [ ]:
titanic_training["AloneS"]=""

In [ ]:
titanic_training["AloneS"].loc[titanic_training["Alone"]>0]="With Family"
titanic_training["AloneS"].loc[titanic_training["Alone"]==0]="Without Family"

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [ ]:
titanic_training["AloneS"].head()

0       With Family
1       With Family
2    Without Family
3       With Family
4    Without Family
Name: AloneS, dtype: object

Group By

In [ ]:
titanic_training.groupby('Sex').count()

        PassengerId  Survived  Pclass  Name  ...  Embarked  person  Alone  AloneS
Sex                                          ...
female          314       314     314   314  ...       312     314    314     314
male            577       577     577   577  ...       577     577    577     577

[2 rows x 14 columns]

In [ ]:
titanic_training.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
Alone            0.904602
dtype: float64

In [ ]:
titanic_training.groupby('Sex').mean()

        PassengerId  Survived    Pclass  ...     Parch       Fare     Alone
Sex                                      ...
female   431.028662  0.742038  2.159236  ...  0.649682  44.479818  1.343949
male     454.147314  0.188908  2.389948  ...  0.235702  25.523893  0.665511

[2 rows x 8 columns]

In [ ]:
titanic_training.groupby(['Sex','Age']).mean()

              PassengerId  Survived  Pclass  SibSp  Parch       Fare  Alone
Sex    Age
female 0.75    557.500000  1.000000     3.0    2.0    1.0  19.258300    3.0
       1.00    277.500000  1.000000     3.0    0.5    1.5  13.437500    2.0
       2.00    379.666667  0.333333     2.5    1.5    1.5  43.245833    3.0
       3.00    209.500000  0.500000     2.5    2.0    1.5  31.327100    3.5
       4.00    451.600000  1.000000     2.6    0.8    1.2  22.828340    2.0
...                   ...       ...     ...    ...    ...        ...    ...
male   70.00   709.500000  0.000000     1.5    0.5    0.5  40.750000    1.0
       70.50   117.000000  0.000000     3.0    0.0    0.0   7.750000    0.0
       71.00   295.500000  0.000000     1.0    0.0    0.0  42.079200    0.0
       74.00   852.000000  0.000000     3.0    0.0    0.0   7.775000    0.0
       80.00   631.000000  1.000000     1.0    0.0    0.0  30.000000    0.0

[147 rows x 7 columns]

In [ ]:
import numpy as np

table = pd.pivot_table(titanic_training, values='Age', index=['Sex'], columns=['Survived'], aggfunc=np.sum)
table

Survived             0            1
Sex
female     2107.885000  6752.168235
male      14590.004706  3011.855882

In [ ]:
table.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, female to male
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      float64
 1   1       2 non-null      float64
dtypes: float64(2)
memory usage: 48.0+ bytes